Nombre de los participantes Prueba2
Juan José Naranjo Velásquez CC : 1039474689
Alejandro Mora Suarez CC: 1128437044
Kenneth David Leonel Triana CC: 1192817456

Parte 1

Se importan las librerias

In [86]:
import numpy as np
import pandas as pd

In [87]:
# Se costruye el dataframe a partir del diccionario
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, 10, 9, 20, 14.5, 12, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
#Se debe dejar el etiquetado con los siguientes labels
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
# Se cambia el etiquetado de los indices
df.index = labels
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   10.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [88]:
# 1) Seleccionar las columnas name y score usando loc 
df.loc[:, ['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James   10.0
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura   12.0
i      Kevin    8.0
j      Jonas   19.0

In [89]:
# 2) Filtre las filas donde el número de intentos (attemps) sea mayor que 2

#Se toma el dataframe se toma la columna attempt para evaluar los intentos mayores que 2 esto nos arrojaria el resultado en booleano
# para finalizar lo que hacemos es englobar el resultado booleano de nuevo en nuestro dataframe y ver los registros que cumplan con la condición 
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James   10.0         3      no
f  Michael   20.0         3     yes

In [90]:
# 3) Filtre las filas donde el score se encuentre entre 15 y 20 (incluidos)

df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [91]:
# 4) Cambie el score en la fila 'd' a 11.5

# Se utiliza loc para seleccionar la fila 'd' y la columna'score' y se establece el nuevo valor en la celda correspondiente 11.5
df.loc['d','score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [92]:
# 5) Agregue una nueva fila con etiqueta 'k' al dataframe con un valor que usted desee para cada colum

# Se crea un nuevo dataframe con un solo registro y se concatena con el dataframe original
filaK = pd.DataFrame({'name': 'Leonardo', 'score': 10, 'attempts': 1, 'qualify': 'yes'}, index=['k'])
df = pd.concat([df, filaK])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k   Leonardo   10.0         1     yes

In [93]:
# 6) Borre la fila 'k' y entregue nuevamente el DataFrame original.
# Se utiliza drop para eliminar la fila 'k'
df = df.drop('k')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura   12.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [94]:
# 7) Ordene el DataFrame por nombre en orden ascendente.
# Se utiliza sort_values para ordenar el dataframe por nombre en orden ascendente
# Como es por orden ascendente no es necesario colocar otro parametro al sort_values
df.sort_values(by='name', ascending=True)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura   12.0         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [97]:
# 8) Reemplace los valores de la columna qualify que contiene los valores yes y no por los valores booleanos True y False respectivamente

#Opcion 1 Se realiza la condicion sobre la columna qualify y se le asigna el valor true o false
df.loc[df['qualify']=='yes', 'qualify'] = True  
df.loc[df['qualify']=='no', 'qualify'] = False 
df

#Opcion 2
# df['qualify'].replace('yes', True) 
# df['qualify'].replace('no', False)
# df

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James   11.5         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura   12.0         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

Parte 2

In [98]:
#Se va importar el dataset athletes desde el repo del profe
url = "https://raw.githubusercontent.com/tomasate/Datos_Clases/main/Datos_1/athletes.csv"
#Se crea el dataframe 
athletes = pd.read_csv(url)
athletes

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
11533,265605954,Zurian Hechavarria,CUB,female,8/10/95,1.64,58.0,athletics,0,0,0
11534,214461847,Zuzana Hejnova,CZE,female,12/19/86,1.73,63.0,athletics,0,0,0
11535,88361042,di Xiao,CHN,male,5/14/91,1.85,100.0,wrestling,0,0,0
11536,900065925,le Quoc Toan Tran,VIE,male,4/5/89,1.60,56.0,weightlifting,0,0,0
11537,711404576,le Roux Hamman,RSA,male,1/6/92,1.85,70.0,athletics,0,0,0

In [99]:
#2) Se va a tomar solo los atletas que hayan ganado una medalla 

athletes[(athletes['gold']> 0 )| (athletes['silver'] > 0) | (athletes['bronze'] > 0)]

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1
6,266237702,Aaron Russell,USA,male,6/4/93,2.05,98.0,volleyball,0,0,1
14,162792594,Abbey Weitzeil,USA,female,12/3/96,1.78,68.0,aquatics,1,1,0
48,962468808,Abdoulrazak Issoufou Alfaga,NIG,male,12/26/94,2.07,98.0,taekwondo,0,1,0
55,969824503,Abdullah Alrashidi,IOA,male,8/21/63,1.83,84.0,shooting,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
11487,334126873,Zhiyong Shi,CHN,male,10/10/93,1.68,69.0,weightlifting,1,0,0
11491,105609876,Zi He,CHN,female,12/10/90,1.60,52.0,aquatics,0,1,0
11503,593183472,Zivko Gocic,SRB,male,8/22/82,1.93,93.0,aquatics,1,0,0
11509,836633838,Zoe Lee,GBR,female,12/15/85,1.76,70.0,rowing,0,1,0
11511,343671816,Zoe de Toledo,GBR,female,7/17/87,1.72,58.0,rowing,0,1,0

In [100]:
# 3) Se define la función que calcule la masa muscular

def calcularMasaMuscular(athletes):
    """
    Esta función calcula la masa muscular de un atleta según el peso y altura del mismo.

    In[0]:Dataframe athletes
    Out[0]:Dataframe con calculo de masa muscular
    """
    # Se calcula la masa muscular según la formula
    masaMuscular = (athletes.weight / (athletes.height ** 2)) 
    return masaMuscular

# Se calcula la masa muscular para cada atleta con el metodo apply y dejamos el axis = 1 para que se aplique la funcion a cada fila
athletes['masa_muscular'] = athletes.apply(calcularMasaMuscular, axis= 1)
athletes

,id,name,nationality,sex,dob,height,weight,sport,gold,silver,bronze,masa_muscular
0,736041664,A Jesus Garcia,ESP,male,10/17/69,1.72,64.0,athletics,0,0,0,21.633315
1,532037425,A Lam Shin,KOR,female,9/23/86,1.68,56.0,fencing,0,0,0,19.841270
2,435962603,Aaron Brown,CAN,male,5/27/92,1.98,79.0,athletics,0,0,1,20.151005
3,521041435,Aaron Cook,MDA,male,1/2/91,1.83,80.0,taekwondo,0,0,0,23.888441
4,33922579,Aaron Gate,NZL,male,11/26/90,1.81,71.0,cycling,0,0,0,21.672110
...,...,...,...,...,...,...,...,...,...,...,...,...
11533,265605954,Zurian Hechavarria,CUB,female,8/10/95,1.64,58.0,athletics,0,0,0,21.564545
11534,214461847,Zuzana Hejnova,CZE,female,12/19/86,1.73,63.0,athletics,0,0,0,21.049818
11535,88361042,di Xiao,CHN,male,5/14/91,1.85,100.0,wrestling,0,0,0,29.218408
11536,900065925,le Quoc Toan Tran,VIE,male,4/5/89,1.60,56.0,weightlifting,0,0,0,21.875000
11537,711404576,le Roux Hamman,RSA,male,1/6/92,1.85,70.0,athletics,0,0,0,20.452885

In [101]:
# 4) Agrupe los datos por el calculo de la media por deporte para cada una del resto de características. ¿Cuál es el deporte en el que los jugadores tienen mayor peso promedio?
promedioDatos=athletes.groupby('sport').agg('mean').sort_values(by = 'weight', ascending=False)
promedioDatos

C:\Users\USER\AppData\Local\Temp\ipykernel_25416\1813867250.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  promedioDatos=athletes.groupby('sport').agg('mean').sort_values(by = 'weight', ascending=False)

,id,height,weight,gold,silver,bronze,masa_muscular
sport,,,,,,,
basketball,5.036080e+08,1.918715,87.750000,0.083333,0.083333,0.083333,23.587790
handball,4.957886e+08,1.837080,83.710602,0.079890,0.082645,0.079890,24.501271
volleyball,4.844270e+08,1.896527,80.102094,0.072917,0.070312,0.072917,22.161799
weightlifting,5.004174e+08,1.666628,79.980620,0.058140,0.058140,0.058140,28.155352
rowing,5.095929e+08,1.849477,79.938318,0.087751,0.087751,0.087751,23.190600
rugby sevens,5.228671e+08,1.755623,78.723906,0.083333,0.080000,0.083333,25.346171
wrestling,4.937765e+08,1.723000,77.742120,0.050992,0.050992,0.101983,25.788894
canoe,5.019726e+08,1.781006,77.015291,0.081571,0.081571,0.084592,24.152080
judo,4.903510e+08,1.735366,76.876316,0.035714,0.035714,0.071429,25.178452
shooting,4.877244e+08,1.728668,73.905263,0.038462,0.038462,0.038462,24.560009
tennis,4.971817e+08,1.802251,73.162304,0.040816,0.040816,0.040816,22.420589
aquatics,4.997725e+08,1.788338,72.301644,0.083045,0.077509,0.073356,22.390026
archery,5.047630e+08,1.735952,72.190476,0.062500,0.062500,0.062500,23.806722
golf,4.741152e+08,1.743761,71.443478,0.016667,0.016667,0.016667,23.333664
sailing,5.085194e+08,1.761478,71.169355,0.039474,0.039474,0.039474,22.829941
fencing,5.527768e+08,1.772449,70.661224,0.085366,0.089431,0.089431,22.366810
hockey,5.178987e+08,1.733981,68.900463,0.078704,0.074074,0.076389,22.773987
badminton,4.901661e+08,1.745529,68.774390,0.046512,0.046512,0.046512,22.459332
football,5.064191e+08,1.745341,68.433962,0.058920,0.058920,0.058920,22.357239
taekwondo,5.245064e+08,1.797480,68.088000,0.062500,0.062500,0.125000,20.911875
cycling,4.978055e+08,1.746667,67.820717,0.051429,0.053333,0.055238,22.129736
athletics,5.016411e+08,1.751922,67.717727,0.027931,0.027084,0.026238,21.805406
equestrian,4.618328e+08,1.748704,67.493023,0.067568,0.067568,0.067568,21.984795
modern pentathlon,4.242136e+08,1.762361,65.958333,0.027778,0.027778,0.027778,21.120357
table tennis,5.024409e+08,1.721845,65.177515,0.046512,0.046512,0.046512,21.822135
triathlon,4.347202e+08,1.732110,60.633028,0.018182,0.018182,0.018182,20.121698
gymnastics,5.121383e+08,1.637840,54.278997,0.092593,0.092593,0.092593,20.174045
boxing,4.731657e+08,1.747745,NaN,0.045455,0.045455,0.090909,NaN

In [102]:
#El deporte con mejor promedio de peso lo sacamos de promedioDatos
promedioDatos.head(1)
#Lo cúal evidenciamos que el deporte con mejor promedio es el de basketball

,id,height,weight,gold,silver,bronze,masa_muscular
sport,,,,,,,
basketball,5.036080e+08,1.918715,87.75,0.083333,0.083333,0.083333,23.58779

In [104]:
# 5 Pais con mayor participacion femenina
# athletes['conteo']= athletes.groupby(['nationality','sex']).size()
athletes2=athletes.pivot_table(index = 'nationality', columns = 'sex', aggfunc= 'count',values='name')
#Cantidad participacion mujeres
cantidadMujeresMax=athletes2['female'].max()
#País con mayor de participación de mujeres
pais=athletes2['female'].idxmax()
athletes2

sex          female  male
nationality
AFG             1.0   2.0
ALB             3.0   3.0
ALG            10.0  58.0
AND             3.0   2.0
ANG            18.0   8.0
...             ...   ...
VIE            13.0  10.0
VIN             2.0   2.0
YEM             1.0   2.0
ZAM             2.0   5.0
ZIM            26.0   9.0

[207 rows x 2 columns]

In [105]:
print (f"El país con mayor participación femenina es {pais} con un total de {cantidadMujeresMax} mujeres")

El país con mayor participación femenina es USA con un total de 303.0 mujeres